
# State **`s3://infrahouse-aws-control-493370826424/terraform.tfstate`**
## Affected resources counts

|  Success  |   🟢 Add |   🟡 Change |   🔴 Destroy |
|:---------:|--------:|-----------:|------------:|
|     ✅     |       3 |          1 |           3 |
## Affected resources by action

|  Action  | Resources                                        |
|:--------:|:-------------------------------------------------|
|    🟡     | `module.jumphost.aws_lambda_function.update_dns` |
|    🟡     | `module.jumphost.random_uuid.lamda_src_hash:`    |
<details>
<summary>STDOUT</summary>

```[command]/home/runner/work/_temp/4512e3ae-12f6-4e1b-8783-8dbcdbc9692c/terraform-bin plan -no-color --out=tf.plan
module.jumphost.random_uuid.lamda_src_hash: Refreshing state... [id=2ced1bdf-b4b5-f6c1-20dc-45aed71f7390]
module.jumphost.null_resource.install_python_dependencies: Refreshing state... [id=4482515730184165882]
data.aws_iam_policy.administrator-access: Reading...
module.jumphost.module.jumphost_profile.data.aws_iam_policy_document.assume: Reading...
module.jumphost.data.aws_iam_policy_document.jumphost_permissions: Reading...
data.aws_availability_zones.uw1: Reading...
module.infrahouse_com.aws_route53_zone.infrahouse_com: Refreshing state... [id=Z07662251LH3YRF2ERM3G]
module.jumphost.data.aws_iam_policy.AWSLambdaBasicExecutionRole: Reading...
module.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.github-permissions: Reading...
module.jumphost.data.aws_caller_identity.current: Reading...
module.jumphost.data.aws_iam_policy_document.jumphost_permissions: Read complete after 0s [id=1152265192]
module.github-connector.aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::493370826424:oidc-provider/token.actions.githubusercontent.com]
aws_key_pair.aleks: Refreshing state... [id=aleks]
module.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.github-permissions: Read complete after 0s [id=3894068826]
module.jumphost.data.aws_iam_policy_document.assume_role: Reading...
module.jumphost.module.jumphost_profile.data.aws_iam_policy_document.assume: Read complete after 0s [id=1903849331]
module.jumphost.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=3693445097]
module.jumphost.aws_s3_bucket.lambda_tmp: Refreshing state... [id=infrahouse-jumphost-lambda-20230713233459675800000001]
module.jumphost.data.aws_region.current: Reading...
module.jumphost.data.aws_ami.ubuntu_22: Reading...
module.jumphost.data.aws_region.current: Read complete after 0s [id=us-west-1]
module.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy.administrator-access: Reading...
module.jumphost.data.aws_caller_identity.current: Read complete after 0s [id=493370826424]
data.aws_ami.ubuntu_22: Reading...
module.management.aws_vpc.vpc: Refreshing state... [id=vpc-08e19d859c26d18b2]
module.jumphost.module.jumphost_profile.aws_iam_role.profile: Refreshing state... [id=jumphost20230710043044761000000002]
data.aws_availability_zones.uw1: Read complete after 1s [id=us-west-1]
module.jumphost.aws_iam_role.iam_for_lambda: Refreshing state... [id=iam_for_lambda]
module.jumphost.data.aws_ami.ubuntu_22: Read complete after 1s [id=ami-0793452df88d33c63]
module.jumphost.module.jumphost_profile.aws_iam_policy.profile: Refreshing state... [id=arn:aws:iam::493370826424:policy/jumphost20230710043044760400000001]
data.aws_ami.ubuntu_22: Read complete after 1s [id=ami-0793452df88d33c63]
module.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.github-assume: Reading...
module.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.github-assume: Read complete after 0s [id=3911844868]
module.management.aws_eip.nat_eip["10.0.0.0/24"]: Refreshing state... [id=eipalloc-02b42e70d52a5db7f]
module.management.aws_eip.nat_eip["10.0.2.0/24"]: Refreshing state... [id=eipalloc-016035246b49102b5]
module.ih-tf-aws-control-493370826424-admin.aws_iam_role.github: Refreshing state... [id=ih-tf-aws-control-493370826424-github]
module.jumphost.module.jumphost_profile.aws_iam_instance_profile.profile: Refreshing state... [id=jumphost]
module.jumphost.module.jumphost_profile.aws_iam_role_policy_attachment.jumphost: Refreshing state... [id=jumphost20230710043044761000000002-20230710043045781100000003]
module.infrahouse_com.aws_route53_record.txt_dkim: Refreshing state... [id=Z07662251LH3YRF2ERM3G_google._domainkey.infrahouse.com_TXT]
module.infrahouse_com.aws_route53_record.mx: Refreshing state... [id=Z07662251LH3YRF2ERM3G_infrahouse.com_MX]
module.infrahouse_com.aws_route53_record.spf: Refreshing state... [id=Z07662251LH3YRF2ERM3G_infrahouse.com_SPF]
module.infrahouse_com.aws_route53_record.txt_spf: Refreshing state... [id=Z07662251LH3YRF2ERM3G_infrahouse.com_TXT]
module.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.admin-assume: Reading...
module.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.admin-assume: Read complete after 0s [id=1382937169]
module.jumphost.aws_launch_template.jumphost: Refreshing state... [id=lt-01a8ef96822b4b00b]
module.ih-tf-aws-control-493370826424-admin.aws_iam_role.admin: Refreshing state... [id=ih-tf-aws-control-493370826424-admin]
module.jumphost.aws_s3_object.lambda_package: Refreshing state... [id=2ced1bdf-b4b5-f6c1-20dc-45aed71f7390.zip]
module.jumphost.aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-jumphost-lambda-20230713233459675800000001]
module.jumphost.aws_lambda_function.update_dns: Refreshing state... [id=update_dns]
module.management.aws_route_table.all["10.0.3.0/24"]: Refreshing state... [id=rtb-0178e1718deba51ce]
module.management.aws_default_security_group.default: Refreshing state... [id=sg-08b960b85f5996100]
module.management.aws_subnet.all["10.0.2.0/24"]: Refreshing state... [id=subnet-083e969dc3779af26]
module.management.aws_subnet.all["10.0.3.0/24"]: Refreshing state... [id=subnet-0cfffaca325d93827]
module.management.aws_subnet.all["10.0.0.0/24"]: Refreshing state... [id=subnet-0df885dcc99418799]
module.management.aws_subnet.all["10.0.1.0/24"]: Refreshing state... [id=subnet-0f91dd2675e7a16c3]
module.management.aws_route_table.all["10.0.0.0/24"]: Refreshing state... [id=rtb-04a16e74d5b12a338]
module.management.aws_route_table.all["10.0.1.0/24"]: Refreshing state... [id=rtb-067c30e65dd4108e9]
module.management.aws_route_table.all["10.0.2.0/24"]: Refreshing state... [id=rtb-0bc6c44c1b26fed22]
module.management.aws_default_route_table.default: Refreshing state... [id=rtb-0d73383afeb6ad142]
module.management.aws_internet_gateway.ig: Refreshing state... [id=igw-079090e09ed5db582]
module.management.aws_nat_gateway.nat_gw["10.0.0.0/24"]: Refreshing state... [id=nat-08fb9b52683277947]
module.management.aws_nat_gateway.nat_gw["10.0.2.0/24"]: Refreshing state... [id=nat-08b1cd06b043099ec]
module.jumphost.aws_autoscaling_group.jumphost: Refreshing state... [id=jumphost-20230710045512165400000001]
module.management.aws_route_table_association.private_rt_assoc["10.0.1.0/24"]: Refreshing state... [id=rtbassoc-099b958af19485f2b]
module.management.aws_route_table_association.private_rt_assoc["10.0.2.0/24"]: Refreshing state... [id=rtbassoc-0e795bdaee627aa6c]
module.management.aws_route_table_association.private_rt_assoc["10.0.3.0/24"]: Refreshing state... [id=rtbassoc-0bf278b6a394aed44]
module.management.aws_route_table_association.private_rt_assoc["10.0.0.0/24"]: Refreshing state... [id=rtbassoc-08a410160e2dcc592]
module.management.aws_route.subnet_public["10.0.2.0/24"]: Refreshing state... [id=r-rtb-0bc6c44c1b26fed221080289494]
module.management.aws_route.subnet_public["10.0.0.0/24"]: Refreshing state... [id=r-rtb-04a16e74d5b12a3381080289494]
module.management.aws_route.default_main: Refreshing state... [id=r-rtb-0d73383afeb6ad1421080289494]
module.management.aws_route.subnet_private["10.0.1.0/24"]: Refreshing state... [id=r-rtb-067c30e65dd4108e91080289494]
module.management.aws_route.subnet_private["10.0.3.0/24"]: Refreshing state... [id=r-rtb-0178e1718deba51ce1080289494]
module.jumphost.aws_cloudwatch_log_group.update_dns: Refreshing state... [id=/aws/lambda/update_dns]
module.jumphost.aws_autoscaling_lifecycle_hook.launching: Refreshing state... [id=launching]
module.jumphost.aws_cloudwatch_event_rule.scale: Refreshing state... [id=jumphost-scale20230711172747504700000001]
module.jumphost.aws_autoscaling_lifecycle_hook.terminating: Refreshing state... [id=terminating]
module.jumphost.data.aws_iam_policy_document.lambda-permissions: Reading...
module.jumphost.data.aws_iam_policy_document.lambda-permissions: Read complete after 0s [id=3590413719]
module.jumphost.aws_iam_policy.lambda_permissions: Refreshing state... [id=arn:aws:iam::493370826424:policy/lambda_permissions20230711160512724200000001]
module.jumphost.aws_iam_role_policy_attachment.lambda_permissions: Refreshing state... [id=iam_for_lambda-20230711160513416100000002]
module.jumphost.data.aws_iam_policy_document.lambda_logging: Reading...
module.jumphost.data.aws_iam_policy_document.lambda_logging: Read complete after 0s [id=2267145382]
module.jumphost.aws_iam_policy.lambda_logging: Refreshing state... [id=arn:aws:iam::493370826424:policy/lambda_logging20230711160513778300000003]
module.jumphost.aws_lambda_permission.allow_cloudwatch: Refreshing state... [id=AllowExecutionFromCloudWatch-out]
module.jumphost.aws_cloudwatch_event_target.scale-out: Refreshing state... [id=jumphost-scale20230711172747504700000001-terraform-20230711172747630900000002]
module.jumphost.aws_iam_role_policy_attachment.lambda_logs: Refreshing state... [id=iam_for_lambda-20230711160514251100000004]
module.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy.administrator-access: Read complete after 2s [id=arn:aws:iam::aws:policy/AdministratorAccess]
module.ih-tf-aws-control-493370826424-admin.aws_iam_role_policy_attachment.admin: Refreshing state... [id=ih-tf-aws-control-493370826424-admin-20230709164321319900000001]
data.aws_iam_policy.administrator-access: Read complete after 2s [id=arn:aws:iam::aws:policy/AdministratorAccess]
module.jumphost.data.aws_iam_policy.AWSLambdaBasicExecutionRole: Read complete after 3s [id=arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole]
module.jumphost.aws_iam_role_policy_attachment.AWSLambdaBasicExecutionRole: Refreshing state... [id=iam_for_lambda-20230710175434878000000001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.jumphost.data.archive_file.lambda will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "lambda" {
      + excludes            = [
          + "__pycache__",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "modules/jumphost/update_dns"
      + type                = "zip"
    }

  # module.jumphost.aws_lambda_function.update_dns will be updated in-place
  ~ resource "aws_lambda_function" "update_dns" {
        id                             = "update_dns"
      ~ last_modified                  = "2023-07-16T03:07:11.000+0000" -> (known after apply)
      ~ s3_key                         = "2ced1bdf-b4b5-f6c1-20dc-45aed71f7390.zip" -> (known after apply)
        tags                           = {}
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.jumphost.aws_s3_object.lambda_package must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "23aaaa29f517e4a401b5ade24ea42bb2-3" -> (known after apply)
      ~ id                     = "2ced1bdf-b4b5-f6c1-20dc-45aed71f7390.zip" -> (known after apply)
      ~ key                    = "2ced1bdf-b4b5-f6c1-20dc-45aed71f7390.zip" # forces replacement -> (known after apply) # forces replacement
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ source                 = "modules/jumphost/2ced1bdf-b4b5-f6c1-20dc-45aed71f7390.zip" -> (known after apply)
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      + version_id             = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.jumphost.null_resource.install_python_dependencies must be replaced
-/+ resource "null_resource" "install_python_dependencies" {
      ~ id       = "4482515730184165882" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "main_version"         = "8b4c5d27da85ecba955aae3d8b2152da" -> "ece32edcdf72a7d156e2a92e1293863d"
            # (1 unchanged element hidden)
        }
    }

  # module.jumphost.random_uuid.lamda_src_hash must be replaced
-/+ resource "random_uuid" "lamda_src_hash" {
      ~ id      = "2ced1bdf-b4b5-f6c1-20dc-45aed71f7390" -> (known after apply)
      ~ keepers = { # forces replacement
          ~ "main.py"          = "8b4c5d27da85ecba955aae3d8b2152da" -> "ece32edcdf72a7d156e2a92e1293863d"
            # (1 unchanged element hidden)
        }
      ~ result  = "2ced1bdf-b4b5-f6c1-20dc-45aed71f7390" -> (known after apply)
    }

Plan: 3 to add, 1 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
::debug::Terraform exited with code 0.
::debug::stdout: module.jumphost.random_uuid.lamda_src_hash: Refreshing state... [id=2ced1bdf-b4b5-f6c1-20dc-45aed71f7390]%0Amodule.jumphost.null_resource.install_python_dependencies: Refreshing state... [id=4482515730184165882]%0Adata.aws_iam_policy.administrator-access: Reading...%0Amodule.jumphost.module.jumphost_profile.data.aws_iam_policy_document.assume: Reading...%0Amodule.jumphost.data.aws_iam_policy_document.jumphost_permissions: Reading...%0Adata.aws_availability_zones.uw1: Reading...%0Amodule.infrahouse_com.aws_route53_zone.infrahouse_com: Refreshing state... [id=Z07662251LH3YRF2ERM3G]%0Amodule.jumphost.data.aws_iam_policy.AWSLambdaBasicExecutionRole: Reading...%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.github-permissions: Reading...%0Amodule.jumphost.data.aws_caller_identity.current: Reading...%0Amodule.jumphost.data.aws_iam_policy_document.jumphost_permissions: Read complete after 0s [id=1152265192]%0Amodule.github-connector.aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::493370826424:oidc-provider/token.actions.githubusercontent.com]%0Aaws_key_pair.aleks: Refreshing state... [id=aleks]%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.github-permissions: Read complete after 0s [id=3894068826]%0Amodule.jumphost.data.aws_iam_policy_document.assume_role: Reading...%0Amodule.jumphost.module.jumphost_profile.data.aws_iam_policy_document.assume: Read complete after 0s [id=1903849331]%0Amodule.jumphost.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=3693445097]%0Amodule.jumphost.aws_s3_bucket.lambda_tmp: Refreshing state... [id=infrahouse-jumphost-lambda-20230713233459675800000001]%0Amodule.jumphost.data.aws_region.current: Reading...%0Amodule.jumphost.data.aws_ami.ubuntu_22: Reading...%0Amodule.jumphost.data.aws_region.current: Read complete after 0s [id=us-west-1]%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy.administrator-access: Reading...%0Amodule.jumphost.data.aws_caller_identity.current: Read complete after 0s [id=493370826424]%0Adata.aws_ami.ubuntu_22: Reading...%0Amodule.management.aws_vpc.vpc: Refreshing state... [id=vpc-08e19d859c26d18b2]%0Amodule.jumphost.module.jumphost_profile.aws_iam_role.profile: Refreshing state... [id=jumphost20230710043044761000000002]%0Adata.aws_availability_zones.uw1: Read complete after 1s [id=us-west-1]%0Amodule.jumphost.aws_iam_role.iam_for_lambda: Refreshing state... [id=iam_for_lambda]%0Amodule.jumphost.data.aws_ami.ubuntu_22: Read complete after 1s [id=ami-0793452df88d33c63]%0Amodule.jumphost.module.jumphost_profile.aws_iam_policy.profile: Refreshing state... [id=arn:aws:iam::493370826424:policy/jumphost20230710043044760400000001]%0Adata.aws_ami.ubuntu_22: Read complete after 1s [id=ami-0793452df88d33c63]%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.github-assume: Reading...%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.github-assume: Read complete after 0s [id=3911844868]%0Amodule.management.aws_eip.nat_eip["10.0.0.0/24"]: Refreshing state... [id=eipalloc-02b42e70d52a5db7f]%0Amodule.management.aws_eip.nat_eip["10.0.2.0/24"]: Refreshing state... [id=eipalloc-016035246b49102b5]%0Amodule.ih-tf-aws-control-493370826424-admin.aws_iam_role.github: Refreshing state... [id=ih-tf-aws-control-493370826424-github]%0Amodule.jumphost.module.jumphost_profile.aws_iam_instance_profile.profile: Refreshing state... [id=jumphost]%0Amodule.jumphost.module.jumphost_profile.aws_iam_role_policy_attachment.jumphost: Refreshing state... [id=jumphost20230710043044761000000002-20230710043045781100000003]%0Amodule.infrahouse_com.aws_route53_record.txt_dkim: Refreshing state... [id=Z07662251LH3YRF2ERM3G_google._domainkey.infrahouse.com_TXT]%0Amodule.infrahouse_com.aws_route53_record.mx: Refreshing state... [id=Z07662251LH3YRF2ERM3G_infrahouse.com_MX]%0Amodule.infrahouse_com.aws_route53_record.spf: Refreshing state... [id=Z07662251LH3YRF2ERM3G_infrahouse.com_SPF]%0Amodule.infrahouse_com.aws_route53_record.txt_spf: Refreshing state... [id=Z07662251LH3YRF2ERM3G_infrahouse.com_TXT]%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.admin-assume: Reading...%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.admin-assume: Read complete after 0s [id=1382937169]%0Amodule.jumphost.aws_launch_template.jumphost: Refreshing state... [id=lt-01a8ef96822b4b00b]%0Amodule.ih-tf-aws-control-493370826424-admin.aws_iam_role.admin: Refreshing state... [id=ih-tf-aws-control-493370826424-admin]%0Amodule.jumphost.aws_s3_object.lambda_package: Refreshing state... [id=2ced1bdf-b4b5-f6c1-20dc-45aed71f7390.zip]%0Amodule.jumphost.aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-jumphost-lambda-20230713233459675800000001]%0Amodule.jumphost.aws_lambda_function.update_dns: Refreshing state... [id=update_dns]%0Amodule.management.aws_route_table.all["10.0.3.0/24"]: Refreshing state... [id=rtb-0178e1718deba51ce]%0Amodule.management.aws_default_security_group.default: Refreshing state... [id=sg-08b960b85f5996100]%0Amodule.management.aws_subnet.all["10.0.2.0/24"]: Refreshing state... [id=subnet-083e969dc3779af26]%0Amodule.management.aws_subnet.all["10.0.3.0/24"]: Refreshing state... [id=subnet-0cfffaca325d93827]%0Amodule.management.aws_subnet.all["10.0.0.0/24"]: Refreshing state... [id=subnet-0df885dcc99418799]%0Amodule.management.aws_subnet.all["10.0.1.0/24"]: Refreshing state... [id=subnet-0f91dd2675e7a16c3]%0Amodule.management.aws_route_table.all["10.0.0.0/24"]: Refreshing state... [id=rtb-04a16e74d5b12a338]%0Amodule.management.aws_route_table.all["10.0.1.0/24"]: Refreshing state... [id=rtb-067c30e65dd4108e9]%0Amodule.management.aws_route_table.all["10.0.2.0/24"]: Refreshing state... [id=rtb-0bc6c44c1b26fed22]%0Amodule.management.aws_default_route_table.default: Refreshing state... [id=rtb-0d73383afeb6ad142]%0Amodule.management.aws_internet_gateway.ig: Refreshing state... [id=igw-079090e09ed5db582]%0Amodule.management.aws_nat_gateway.nat_gw["10.0.0.0/24"]: Refreshing state... [id=nat-08fb9b52683277947]%0Amodule.management.aws_nat_gateway.nat_gw["10.0.2.0/24"]: Refreshing state... [id=nat-08b1cd06b043099ec]%0Amodule.jumphost.aws_autoscaling_group.jumphost: Refreshing state... [id=jumphost-20230710045512165400000001]%0Amodule.management.aws_route_table_association.private_rt_assoc["10.0.1.0/24"]: Refreshing state... [id=rtbassoc-099b958af19485f2b]%0Amodule.management.aws_route_table_association.private_rt_assoc["10.0.2.0/24"]: Refreshing state... [id=rtbassoc-0e795bdaee627aa6c]%0Amodule.management.aws_route_table_association.private_rt_assoc["10.0.3.0/24"]: Refreshing state... [id=rtbassoc-0bf278b6a394aed44]%0Amodule.management.aws_route_table_association.private_rt_assoc["10.0.0.0/24"]: Refreshing state... [id=rtbassoc-08a410160e2dcc592]%0Amodule.management.aws_route.subnet_public["10.0.2.0/24"]: Refreshing state... [id=r-rtb-0bc6c44c1b26fed221080289494]%0Amodule.management.aws_route.subnet_public["10.0.0.0/24"]: Refreshing state... [id=r-rtb-04a16e74d5b12a3381080289494]%0Amodule.management.aws_route.default_main: Refreshing state... [id=r-rtb-0d73383afeb6ad1421080289494]%0Amodule.management.aws_route.subnet_private["10.0.1.0/24"]: Refreshing state... [id=r-rtb-067c30e65dd4108e91080289494]%0Amodule.management.aws_route.subnet_private["10.0.3.0/24"]: Refreshing state... [id=r-rtb-0178e1718deba51ce1080289494]%0Amodule.jumphost.aws_cloudwatch_log_group.update_dns: Refreshing state... [id=/aws/lambda/update_dns]%0Amodule.jumphost.aws_autoscaling_lifecycle_hook.launching: Refreshing state... [id=launching]%0Amodule.jumphost.aws_cloudwatch_event_rule.scale: Refreshing state... [id=jumphost-scale20230711172747504700000001]%0Amodule.jumphost.aws_autoscaling_lifecycle_hook.terminating: Refreshing state... [id=terminating]%0Amodule.jumphost.data.aws_iam_policy_document.lambda-permissions: Reading...%0Amodule.jumphost.data.aws_iam_policy_document.lambda-permissions: Read complete after 0s [id=3590413719]%0Amodule.jumphost.aws_iam_policy.lambda_permissions: Refreshing state... [id=arn:aws:iam::493370826424:policy/lambda_permissions20230711160512724200000001]%0Amodule.jumphost.aws_iam_role_policy_attachment.lambda_permissions: Refreshing state... [id=iam_for_lambda-20230711160513416100000002]%0Amodule.jumphost.data.aws_iam_policy_document.lambda_logging: Reading...%0Amodule.jumphost.data.aws_iam_policy_document.lambda_logging: Read complete after 0s [id=2267145382]%0Amodule.jumphost.aws_iam_policy.lambda_logging: Refreshing state... [id=arn:aws:iam::493370826424:policy/lambda_logging20230711160513778300000003]%0Amodule.jumphost.aws_lambda_permission.allow_cloudwatch: Refreshing state... [id=AllowExecutionFromCloudWatch-out]%0Amodule.jumphost.aws_cloudwatch_event_target.scale-out: Refreshing state... [id=jumphost-scale20230711172747504700000001-terraform-20230711172747630900000002]%0Amodule.jumphost.aws_iam_role_policy_attachment.lambda_logs: Refreshing state... [id=iam_for_lambda-20230711160514251100000004]%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy.administrator-access: Read complete after 2s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Amodule.ih-tf-aws-control-493370826424-admin.aws_iam_role_policy_attachment.admin: Refreshing state... [id=ih-tf-aws-control-493370826424-admin-20230709164321319900000001]%0Adata.aws_iam_policy.administrator-access: Read complete after 2s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Amodule.jumphost.data.aws_iam_policy.AWSLambdaBasicExecutionRole: Read complete after 3s [id=arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole]%0Amodule.jumphost.aws_iam_role_policy_attachment.AWSLambdaBasicExecutionRole: Refreshing state... [id=iam_for_lambda-20230710175434878000000001]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  ~ update in-place%0A-/+ destroy and then create replacement%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # module.jumphost.data.archive_file.lambda will be read during apply%0A  # (config refers to values not yet known)%0A <= data "archive_file" "lambda" {%0A      + excludes            = [%0A          + "__pycache__",%0A        ]%0A      + id                  = (known after apply)%0A      + output_base64sha256 = (known after apply)%0A      + output_base64sha512 = (known after apply)%0A      + output_md5          = (known after apply)%0A      + output_path         = (known after apply)%0A      + output_sha          = (known after apply)%0A      + output_sha256       = (known after apply)%0A      + output_sha512       = (known after apply)%0A      + output_size         = (known after apply)%0A      + source_dir          = "modules/jumphost/update_dns"%0A      + type                = "zip"%0A    }%0A%0A  # module.jumphost.aws_lambda_function.update_dns will be updated in-place%0A  ~ resource "aws_lambda_function" "update_dns" {%0A        id                             = "update_dns"%0A      ~ last_modified                  = "2023-07-16T03:07:11.000+0000" -> (known after apply)%0A      ~ s3_key                         = "2ced1bdf-b4b5-f6c1-20dc-45aed71f7390.zip" -> (known after apply)%0A        tags                           = {}%0A        # (21 unchanged attributes hidden)%0A%0A        # (3 unchanged blocks hidden)%0A    }%0A%0A  # module.jumphost.aws_s3_object.lambda_package must be replaced%0A-/+ resource "aws_s3_object" "lambda_package" {%0A      ~ bucket_key_enabled     = false -> (known after apply)%0A      ~ content_type           = "binary/octet-stream" -> (known after apply)%0A      ~ etag                   = "23aaaa29f517e4a401b5ade24ea42bb2-3" -> (known after apply)%0A      ~ id                     = "2ced1bdf-b4b5-f6c1-20dc-45aed71f7390.zip" -> (known after apply)%0A      ~ key                    = "2ced1bdf-b4b5-f6c1-20dc-45aed71f7390.zip" # forces replacement -> (known after apply) # forces replacement%0A      + kms_key_id             = (known after apply)%0A      - metadata               = {} -> null%0A      ~ server_side_encryption = "AES256" -> (known after apply)%0A      ~ source                 = "modules/jumphost/2ced1bdf-b4b5-f6c1-20dc-45aed71f7390.zip" -> (known after apply)%0A      ~ storage_class          = "STANDARD" -> (known after apply)%0A      - tags                   = {} -> null%0A      + version_id             = (known after apply)%0A        # (4 unchanged attributes hidden)%0A    }%0A%0A  # module.jumphost.null_resource.install_python_dependencies must be replaced%0A-/+ resource "null_resource" "install_python_dependencies" {%0A      ~ id       = "4482515730184165882" -> (known after apply)%0A      ~ triggers = { # forces replacement%0A          ~ "main_version"         = "8b4c5d27da85ecba955aae3d8b2152da" -> "ece32edcdf72a7d156e2a92e1293863d"%0A            # (1 unchanged element hidden)%0A        }%0A    }%0A%0A  # module.jumphost.random_uuid.lamda_src_hash must be replaced%0A-/+ resource "random_uuid" "lamda_src_hash" {%0A      ~ id      = "2ced1bdf-b4b5-f6c1-20dc-45aed71f7390" -> (known after apply)%0A      ~ keepers = { # forces replacement%0A          ~ "main.py"          = "8b4c5d27da85ecba955aae3d8b2152da" -> "ece32edcdf72a7d156e2a92e1293863d"%0A            # (1 unchanged element hidden)%0A        }%0A      ~ result  = "2ced1bdf-b4b5-f6c1-20dc-45aed71f7390" -> (known after apply)%0A    }%0A%0APlan: 3 to add, 1 to change, 3 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: tf.plan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "tf.plan"%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>
<details>
<summary>STDERR</summary>

```no output```
</details>
<details><summary><i>metadata</i></summary>
<p>
```eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgInN0ZG91dCI6ICJbY29tbWFuZF0vaG9tZS9ydW5uZXIvd29yay9fdGVtcC80NTEyZTNhZS0xMmY2LTRlMWItODc4My04ZGJjZGJjOTY5MmMvdGVycmFmb3JtLWJpbiBwbGFuIC1uby1jb2xvciAtLW91dD10Zi5wbGFuXG5tb2R1bGUuanVtcGhvc3QucmFuZG9tX3V1aWQubGFtZGFfc3JjX2hhc2g6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTJjZWQxYmRmLWI0YjUtZjZjMS0yMGRjLTQ1YWVkNzFmNzM5MF1cbm1vZHVsZS5qdW1waG9zdC5udWxsX3Jlc291cmNlLmluc3RhbGxfcHl0aG9uX2RlcGVuZGVuY2llczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NDQ4MjUxNTczMDE4NDE2NTg4Ml1cbmRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW5pc3RyYXRvci1hY2Nlc3M6IFJlYWRpbmcuLi5cbm1vZHVsZS5qdW1waG9zdC5tb2R1bGUuanVtcGhvc3RfcHJvZmlsZS5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFzc3VtZTogUmVhZGluZy4uLlxubW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuanVtcGhvc3RfcGVybWlzc2lvbnM6IFJlYWRpbmcuLi5cbmRhdGEuYXdzX2F2YWlsYWJpbGl0eV96b25lcy51dzE6IFJlYWRpbmcuLi5cbm1vZHVsZS5pbmZyYWhvdXNlX2NvbS5hd3Nfcm91dGU1M196b25lLmluZnJhaG91c2VfY29tOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1aMDc2NjIyNTFMSDNZUkYyRVJNM0ddXG5tb2R1bGUuanVtcGhvc3QuZGF0YS5hd3NfaWFtX3BvbGljeS5BV1NMYW1iZGFCYXNpY0V4ZWN1dGlvblJvbGU6IFJlYWRpbmcuLi5cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItcGVybWlzc2lvbnM6IFJlYWRpbmcuLi5cbm1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19jYWxsZXJfaWRlbnRpdHkuY3VycmVudDogUmVhZGluZy4uLlxubW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuanVtcGhvc3RfcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTExNTIyNjUxOTJdXG5tb2R1bGUuZ2l0aHViLWNvbm5lY3Rvci5hd3NfaWFtX29wZW5pZF9jb25uZWN0X3Byb3ZpZGVyLmdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjQ5MzM3MDgyNjQyNDpvaWRjLXByb3ZpZGVyL3Rva2VuLmFjdGlvbnMuZ2l0aHVidXNlcmNvbnRlbnQuY29tXVxuYXdzX2tleV9wYWlyLmFsZWtzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hbGVrc11cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTM4OTQwNjg4MjZdXG5tb2R1bGUuanVtcGhvc3QuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hc3N1bWVfcm9sZTogUmVhZGluZy4uLlxubW9kdWxlLmp1bXBob3N0Lm1vZHVsZS5qdW1waG9zdF9wcm9maWxlLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xOTAzODQ5MzMxXVxubW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYXNzdW1lX3JvbGU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTM2OTM0NDUwOTddXG5tb2R1bGUuanVtcGhvc3QuYXdzX3MzX2J1Y2tldC5sYW1iZGFfdG1wOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWp1bXBob3N0LWxhbWJkYS0yMDIzMDcxMzIzMzQ1OTY3NTgwMDAwMDAwMV1cbm1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19yZWdpb24uY3VycmVudDogUmVhZGluZy4uLlxubW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX2FtaS51YnVudHVfMjI6IFJlYWRpbmcuLi5cbm1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19yZWdpb24uY3VycmVudDogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9dXMtd2VzdC0xXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5LmFkbWluaXN0cmF0b3ItYWNjZXNzOiBSZWFkaW5nLi4uXG5tb2R1bGUuanVtcGhvc3QuZGF0YS5hd3NfY2FsbGVyX2lkZW50aXR5LmN1cnJlbnQ6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTQ5MzM3MDgyNjQyNF1cbmRhdGEuYXdzX2FtaS51YnVudHVfMjI6IFJlYWRpbmcuLi5cbm1vZHVsZS5tYW5hZ2VtZW50LmF3c192cGMudnBjOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD12cGMtMDhlMTlkODU5YzI2ZDE4YjJdXG5tb2R1bGUuanVtcGhvc3QubW9kdWxlLmp1bXBob3N0X3Byb2ZpbGUuYXdzX2lhbV9yb2xlLnByb2ZpbGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWp1bXBob3N0MjAyMzA3MTAwNDMwNDQ3NjEwMDAwMDAwMDJdXG5kYXRhLmF3c19hdmFpbGFiaWxpdHlfem9uZXMudXcxOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDFzIFtpZD11cy13ZXN0LTFdXG5tb2R1bGUuanVtcGhvc3QuYXdzX2lhbV9yb2xlLmlhbV9mb3JfbGFtYmRhOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pYW1fZm9yX2xhbWJkYV1cbm1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19hbWkudWJ1bnR1XzIyOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDFzIFtpZD1hbWktMDc5MzQ1MmRmODhkMzNjNjNdXG5tb2R1bGUuanVtcGhvc3QubW9kdWxlLmp1bXBob3N0X3Byb2ZpbGUuYXdzX2lhbV9wb2xpY3kucHJvZmlsZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjQ5MzM3MDgyNjQyNDpwb2xpY3kvanVtcGhvc3QyMDIzMDcxMDA0MzA0NDc2MDQwMDAwMDAwMV1cbmRhdGEuYXdzX2FtaS51YnVudHVfMjI6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMXMgW2lkPWFtaS0wNzkzNDUyZGY4OGQzM2M2M11cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItYXNzdW1lOiBSZWFkaW5nLi4uXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MzkxMTg0NDg2OF1cbm1vZHVsZS5tYW5hZ2VtZW50LmF3c19laXAubmF0X2VpcFtcIjEwLjAuMC4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1laXBhbGxvYy0wMmI0MmU3MGQ1MmE1ZGI3Zl1cbm1vZHVsZS5tYW5hZ2VtZW50LmF3c19laXAubmF0X2VpcFtcIjEwLjAuMi4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1laXBhbGxvYy0wMTYwMzUyNDZiNDkxMDJiNV1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW4uYXdzX2lhbV9yb2xlLmdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWdpdGh1Yl1cbm1vZHVsZS5qdW1waG9zdC5tb2R1bGUuanVtcGhvc3RfcHJvZmlsZS5hd3NfaWFtX2luc3RhbmNlX3Byb2ZpbGUucHJvZmlsZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9anVtcGhvc3RdXG5tb2R1bGUuanVtcGhvc3QubW9kdWxlLmp1bXBob3N0X3Byb2ZpbGUuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50Lmp1bXBob3N0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1qdW1waG9zdDIwMjMwNzEwMDQzMDQ0NzYxMDAwMDAwMDAyLTIwMjMwNzEwMDQzMDQ1NzgxMTAwMDAwMDAzXVxubW9kdWxlLmluZnJhaG91c2VfY29tLmF3c19yb3V0ZTUzX3JlY29yZC50eHRfZGtpbTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9WjA3NjYyMjUxTEgzWVJGMkVSTTNHX2dvb2dsZS5fZG9tYWlua2V5LmluZnJhaG91c2UuY29tX1RYVF1cbm1vZHVsZS5pbmZyYWhvdXNlX2NvbS5hd3Nfcm91dGU1M19yZWNvcmQubXg6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPVowNzY2MjI1MUxIM1lSRjJFUk0zR19pbmZyYWhvdXNlLmNvbV9NWF1cbm1vZHVsZS5pbmZyYWhvdXNlX2NvbS5hd3Nfcm91dGU1M19yZWNvcmQuc3BmOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1aMDc2NjIyNTFMSDNZUkYyRVJNM0dfaW5mcmFob3VzZS5jb21fU1BGXVxubW9kdWxlLmluZnJhaG91c2VfY29tLmF3c19yb3V0ZTUzX3JlY29yZC50eHRfc3BmOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1aMDc2NjIyNTFMSDNZUkYyRVJNM0dfaW5mcmFob3VzZS5jb21fVFhUXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFkbWluLWFzc3VtZTogUmVhZGluZy4uLlxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFkbWluLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MTM4MjkzNzE2OV1cbm1vZHVsZS5qdW1waG9zdC5hd3NfbGF1bmNoX3RlbXBsYXRlLmp1bXBob3N0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1sdC0wMWE4ZWY5NjgyMmI0YjAwYl1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW4uYXdzX2lhbV9yb2xlLmFkbWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW5dXG5tb2R1bGUuanVtcGhvc3QuYXdzX3MzX29iamVjdC5sYW1iZGFfcGFja2FnZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9MmNlZDFiZGYtYjRiNS1mNmMxLTIwZGMtNDVhZWQ3MWY3MzkwLnppcF1cbm1vZHVsZS5qdW1waG9zdC5hd3NfczNfYnVja2V0X3B1YmxpY19hY2Nlc3NfYmxvY2sucHVibGljX2FjY2VzczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1qdW1waG9zdC1sYW1iZGEtMjAyMzA3MTMyMzM0NTk2NzU4MDAwMDAwMDFdXG5tb2R1bGUuanVtcGhvc3QuYXdzX2xhbWJkYV9mdW5jdGlvbi51cGRhdGVfZG5zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD11cGRhdGVfZG5zXVxubW9kdWxlLm1hbmFnZW1lbnQuYXdzX3JvdXRlX3RhYmxlLmFsbFtcIjEwLjAuMy4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGItMDE3OGUxNzE4ZGViYTUxY2VdXG5tb2R1bGUubWFuYWdlbWVudC5hd3NfZGVmYXVsdF9zZWN1cml0eV9ncm91cC5kZWZhdWx0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zZy0wOGI5NjBiODVmNTk5NjEwMF1cbm1vZHVsZS5tYW5hZ2VtZW50LmF3c19zdWJuZXQuYWxsW1wiMTAuMC4yLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXN1Ym5ldC0wODNlOTY5ZGMzNzc5YWYyNl1cbm1vZHVsZS5tYW5hZ2VtZW50LmF3c19zdWJuZXQuYWxsW1wiMTAuMC4zLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXN1Ym5ldC0wY2ZmZmFjYTMyNWQ5MzgyN11cbm1vZHVsZS5tYW5hZ2VtZW50LmF3c19zdWJuZXQuYWxsW1wiMTAuMC4wLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXN1Ym5ldC0wZGY4ODVkY2M5OTQxODc5OV1cbm1vZHVsZS5tYW5hZ2VtZW50LmF3c19zdWJuZXQuYWxsW1wiMTAuMC4xLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXN1Ym5ldC0wZjkxZGQyNjc1ZTdhMTZjM11cbm1vZHVsZS5tYW5hZ2VtZW50LmF3c19yb3V0ZV90YWJsZS5hbGxbXCIxMC4wLjAuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cnRiLTA0YTE2ZTc0ZDViMTJhMzM4XVxubW9kdWxlLm1hbmFnZW1lbnQuYXdzX3JvdXRlX3RhYmxlLmFsbFtcIjEwLjAuMS4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGItMDY3YzMwZTY1ZGQ0MTA4ZTldXG5tb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGVfdGFibGUuYWxsW1wiMTAuMC4yLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXJ0Yi0wYmM2YzQ0YzFiMjZmZWQyMl1cbm1vZHVsZS5tYW5hZ2VtZW50LmF3c19kZWZhdWx0X3JvdXRlX3RhYmxlLmRlZmF1bHQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXJ0Yi0wZDczMzgzYWZlYjZhZDE0Ml1cbm1vZHVsZS5tYW5hZ2VtZW50LmF3c19pbnRlcm5ldF9nYXRld2F5LmlnOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pZ3ctMDc5MDkwZTA5ZWQ1ZGI1ODJdXG5tb2R1bGUubWFuYWdlbWVudC5hd3NfbmF0X2dhdGV3YXkubmF0X2d3W1wiMTAuMC4wLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPW5hdC0wOGZiOWI1MjY4MzI3Nzk0N11cbm1vZHVsZS5tYW5hZ2VtZW50LmF3c19uYXRfZ2F0ZXdheS5uYXRfZ3dbXCIxMC4wLjIuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9bmF0LTA4YjFjZDA2YjA0MzA5OWVjXVxubW9kdWxlLmp1bXBob3N0LmF3c19hdXRvc2NhbGluZ19ncm91cC5qdW1waG9zdDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9anVtcGhvc3QtMjAyMzA3MTAwNDU1MTIxNjU0MDAwMDAwMDFdXG5tb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGVfdGFibGVfYXNzb2NpYXRpb24ucHJpdmF0ZV9ydF9hc3NvY1tcIjEwLjAuMS4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGJhc3NvYy0wOTliOTU4YWYxOTQ4NWYyYl1cbm1vZHVsZS5tYW5hZ2VtZW50LmF3c19yb3V0ZV90YWJsZV9hc3NvY2lhdGlvbi5wcml2YXRlX3J0X2Fzc29jW1wiMTAuMC4yLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXJ0YmFzc29jLTBlNzk1YmRhZWU2MjdhYTZjXVxubW9kdWxlLm1hbmFnZW1lbnQuYXdzX3JvdXRlX3RhYmxlX2Fzc29jaWF0aW9uLnByaXZhdGVfcnRfYXNzb2NbXCIxMC4wLjMuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cnRiYXNzb2MtMGJmMjc4YjZhMzk0YWVkNDRdXG5tb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGVfdGFibGVfYXNzb2NpYXRpb24ucHJpdmF0ZV9ydF9hc3NvY1tcIjEwLjAuMC4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGJhc3NvYy0wOGE0MTAxNjBlMmRjYzU5Ml1cbm1vZHVsZS5tYW5hZ2VtZW50LmF3c19yb3V0ZS5zdWJuZXRfcHVibGljW1wiMTAuMC4yLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXItcnRiLTBiYzZjNDRjMWIyNmZlZDIyMTA4MDI4OTQ5NF1cbm1vZHVsZS5tYW5hZ2VtZW50LmF3c19yb3V0ZS5zdWJuZXRfcHVibGljW1wiMTAuMC4wLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXItcnRiLTA0YTE2ZTc0ZDViMTJhMzM4MTA4MDI4OTQ5NF1cbm1vZHVsZS5tYW5hZ2VtZW50LmF3c19yb3V0ZS5kZWZhdWx0X21haW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXItcnRiLTBkNzMzODNhZmViNmFkMTQyMTA4MDI4OTQ5NF1cbm1vZHVsZS5tYW5hZ2VtZW50LmF3c19yb3V0ZS5zdWJuZXRfcHJpdmF0ZVtcIjEwLjAuMS4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1yLXJ0Yi0wNjdjMzBlNjVkZDQxMDhlOTEwODAyODk0OTRdXG5tb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGUuc3VibmV0X3ByaXZhdGVbXCIxMC4wLjMuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ci1ydGItMDE3OGUxNzE4ZGViYTUxY2UxMDgwMjg5NDk0XVxubW9kdWxlLmp1bXBob3N0LmF3c19jbG91ZHdhdGNoX2xvZ19ncm91cC51cGRhdGVfZG5zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD0vYXdzL2xhbWJkYS91cGRhdGVfZG5zXVxubW9kdWxlLmp1bXBob3N0LmF3c19hdXRvc2NhbGluZ19saWZlY3ljbGVfaG9vay5sYXVuY2hpbmc6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWxhdW5jaGluZ11cbm1vZHVsZS5qdW1waG9zdC5hd3NfY2xvdWR3YXRjaF9ldmVudF9ydWxlLnNjYWxlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1qdW1waG9zdC1zY2FsZTIwMjMwNzExMTcyNzQ3NTA0NzAwMDAwMDAxXVxubW9kdWxlLmp1bXBob3N0LmF3c19hdXRvc2NhbGluZ19saWZlY3ljbGVfaG9vay50ZXJtaW5hdGluZzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVybWluYXRpbmddXG5tb2R1bGUuanVtcGhvc3QuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5sYW1iZGEtcGVybWlzc2lvbnM6IFJlYWRpbmcuLi5cbm1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmxhbWJkYS1wZXJtaXNzaW9uczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MzU5MDQxMzcxOV1cbm1vZHVsZS5qdW1waG9zdC5hd3NfaWFtX3BvbGljeS5sYW1iZGFfcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjo0OTMzNzA4MjY0MjQ6cG9saWN5L2xhbWJkYV9wZXJtaXNzaW9uczIwMjMwNzExMTYwNTEyNzI0MjAwMDAwMDAxXVxubW9kdWxlLmp1bXBob3N0LmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5sYW1iZGFfcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWlhbV9mb3JfbGFtYmRhLTIwMjMwNzExMTYwNTEzNDE2MTAwMDAwMDAyXVxubW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQubGFtYmRhX2xvZ2dpbmc6IFJlYWRpbmcuLi5cbm1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmxhbWJkYV9sb2dnaW5nOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yMjY3MTQ1MzgyXVxubW9kdWxlLmp1bXBob3N0LmF3c19pYW1fcG9saWN5LmxhbWJkYV9sb2dnaW5nOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6NDkzMzcwODI2NDI0OnBvbGljeS9sYW1iZGFfbG9nZ2luZzIwMjMwNzExMTYwNTEzNzc4MzAwMDAwMDAzXVxubW9kdWxlLmp1bXBob3N0LmF3c19sYW1iZGFfcGVybWlzc2lvbi5hbGxvd19jbG91ZHdhdGNoOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1BbGxvd0V4ZWN1dGlvbkZyb21DbG91ZFdhdGNoLW91dF1cbm1vZHVsZS5qdW1waG9zdC5hd3NfY2xvdWR3YXRjaF9ldmVudF90YXJnZXQuc2NhbGUtb3V0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1qdW1waG9zdC1zY2FsZTIwMjMwNzExMTcyNzQ3NTA0NzAwMDAwMDAxLXRlcnJhZm9ybS0yMDIzMDcxMTE3Mjc0NzYzMDkwMDAwMDAwMl1cbm1vZHVsZS5qdW1waG9zdC5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQubGFtYmRhX2xvZ3M6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWlhbV9mb3JfbGFtYmRhLTIwMjMwNzExMTYwNTE0MjUxMTAwMDAwMDA0XVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5LmFkbWluaXN0cmF0b3ItYWNjZXNzOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDJzIFtpZD1hcm46YXdzOmlhbTo6YXdzOnBvbGljeS9BZG1pbmlzdHJhdG9yQWNjZXNzXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuYWRtaW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi0yMDIzMDcwOTE2NDMyMTMxOTkwMDAwMDAwMV1cbmRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW5pc3RyYXRvci1hY2Nlc3M6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMnMgW2lkPWFybjphd3M6aWFtOjphd3M6cG9saWN5L0FkbWluaXN0cmF0b3JBY2Nlc3NdXG5tb2R1bGUuanVtcGhvc3QuZGF0YS5hd3NfaWFtX3BvbGljeS5BV1NMYW1iZGFCYXNpY0V4ZWN1dGlvblJvbGU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgM3MgW2lkPWFybjphd3M6aWFtOjphd3M6cG9saWN5L3NlcnZpY2Utcm9sZS9BV1NMYW1iZGFCYXNpY0V4ZWN1dGlvblJvbGVdXG5tb2R1bGUuanVtcGhvc3QuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LkFXU0xhbWJkYUJhc2ljRXhlY3V0aW9uUm9sZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWFtX2Zvcl9sYW1iZGEtMjAyMzA3MTAxNzU0MzQ4NzgwMDAwMDAwMDFdXG5cblRlcnJhZm9ybSB1c2VkIHRoZSBzZWxlY3RlZCBwcm92aWRlcnMgdG8gZ2VuZXJhdGUgdGhlIGZvbGxvd2luZyBleGVjdXRpb25cbnBsYW4uIFJlc291cmNlIGFjdGlvbnMgYXJlIGluZGljYXRlZCB3aXRoIHRoZSBmb2xsb3dpbmcgc3ltYm9sczpcbiAgfiB1cGRhdGUgaW4tcGxhY2Vcbi0vKyBkZXN0cm95IGFuZCB0aGVuIGNyZWF0ZSByZXBsYWNlbWVudFxuIDw9IHJlYWQgKGRhdGEgcmVzb3VyY2VzKVxuXG5UZXJyYWZvcm0gd2lsbCBwZXJmb3JtIHRoZSBmb2xsb3dpbmcgYWN0aW9uczpcblxuICAjIG1vZHVsZS5qdW1waG9zdC5kYXRhLmFyY2hpdmVfZmlsZS5sYW1iZGEgd2lsbCBiZSByZWFkIGR1cmluZyBhcHBseVxuICAjIChjb25maWcgcmVmZXJzIHRvIHZhbHVlcyBub3QgeWV0IGtub3duKVxuIDw9IGRhdGEgXCJhcmNoaXZlX2ZpbGVcIiBcImxhbWJkYVwiIHtcbiAgICAgICsgZXhjbHVkZXMgICAgICAgICAgICA9IFtcbiAgICAgICAgICArIFwiX19weWNhY2hlX19cIixcbiAgICAgICAgXVxuICAgICAgKyBpZCAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBvdXRwdXRfYmFzZTY0c2hhMjU2ID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBvdXRwdXRfYmFzZTY0c2hhNTEyID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBvdXRwdXRfbWQ1ICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBvdXRwdXRfcGF0aCAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBvdXRwdXRfc2hhICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBvdXRwdXRfc2hhMjU2ICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBvdXRwdXRfc2hhNTEyICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBvdXRwdXRfc2l6ZSAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBzb3VyY2VfZGlyICAgICAgICAgID0gXCJtb2R1bGVzL2p1bXBob3N0L3VwZGF0ZV9kbnNcIlxuICAgICAgKyB0eXBlICAgICAgICAgICAgICAgID0gXCJ6aXBcIlxuICAgIH1cblxuICAjIG1vZHVsZS5qdW1waG9zdC5hd3NfbGFtYmRhX2Z1bmN0aW9uLnVwZGF0ZV9kbnMgd2lsbCBiZSB1cGRhdGVkIGluLXBsYWNlXG4gIH4gcmVzb3VyY2UgXCJhd3NfbGFtYmRhX2Z1bmN0aW9uXCIgXCJ1cGRhdGVfZG5zXCIge1xuICAgICAgICBpZCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcInVwZGF0ZV9kbnNcIlxuICAgICAgfiBsYXN0X21vZGlmaWVkICAgICAgICAgICAgICAgICAgPSBcIjIwMjMtMDctMTZUMDM6MDc6MTEuMDAwKzAwMDBcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICB+IHMzX2tleSAgICAgICAgICAgICAgICAgICAgICAgICA9IFwiMmNlZDFiZGYtYjRiNS1mNmMxLTIwZGMtNDVhZWQ3MWY3MzkwLnppcFwiIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICAgdGFncyAgICAgICAgICAgICAgICAgICAgICAgICAgID0ge31cbiAgICAgICAgIyAoMjEgdW5jaGFuZ2VkIGF0dHJpYnV0ZXMgaGlkZGVuKVxuXG4gICAgICAgICMgKDMgdW5jaGFuZ2VkIGJsb2NrcyBoaWRkZW4pXG4gICAgfVxuXG4gICMgbW9kdWxlLmp1bXBob3N0LmF3c19zM19vYmplY3QubGFtYmRhX3BhY2thZ2UgbXVzdCBiZSByZXBsYWNlZFxuLS8rIHJlc291cmNlIFwiYXdzX3MzX29iamVjdFwiIFwibGFtYmRhX3BhY2thZ2VcIiB7XG4gICAgICB+IGJ1Y2tldF9rZXlfZW5hYmxlZCAgICAgPSBmYWxzZSAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICB+IGNvbnRlbnRfdHlwZSAgICAgICAgICAgPSBcImJpbmFyeS9vY3RldC1zdHJlYW1cIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICB+IGV0YWcgICAgICAgICAgICAgICAgICAgPSBcIjIzYWFhYTI5ZjUxN2U0YTQwMWI1YWRlMjRlYTQyYmIyLTNcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICB+IGlkICAgICAgICAgICAgICAgICAgICAgPSBcIjJjZWQxYmRmLWI0YjUtZjZjMS0yMGRjLTQ1YWVkNzFmNzM5MC56aXBcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICB+IGtleSAgICAgICAgICAgICAgICAgICAgPSBcIjJjZWQxYmRmLWI0YjUtZjZjMS0yMGRjLTQ1YWVkNzFmNzM5MC56aXBcIiAjIGZvcmNlcyByZXBsYWNlbWVudCAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpICMgZm9yY2VzIHJlcGxhY2VtZW50XG4gICAgICArIGttc19rZXlfaWQgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICAtIG1ldGFkYXRhICAgICAgICAgICAgICAgPSB7fSAtPiBudWxsXG4gICAgICB+IHNlcnZlcl9zaWRlX2VuY3J5cHRpb24gPSBcIkFFUzI1NlwiIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIH4gc291cmNlICAgICAgICAgICAgICAgICA9IFwibW9kdWxlcy9qdW1waG9zdC8yY2VkMWJkZi1iNGI1LWY2YzEtMjBkYy00NWFlZDcxZjczOTAuemlwXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgfiBzdG9yYWdlX2NsYXNzICAgICAgICAgID0gXCJTVEFOREFSRFwiIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIC0gdGFncyAgICAgICAgICAgICAgICAgICA9IHt9IC0+IG51bGxcbiAgICAgICsgdmVyc2lvbl9pZCAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICAgIyAoNCB1bmNoYW5nZWQgYXR0cmlidXRlcyBoaWRkZW4pXG4gICAgfVxuXG4gICMgbW9kdWxlLmp1bXBob3N0Lm51bGxfcmVzb3VyY2UuaW5zdGFsbF9weXRob25fZGVwZW5kZW5jaWVzIG11c3QgYmUgcmVwbGFjZWRcbi0vKyByZXNvdXJjZSBcIm51bGxfcmVzb3VyY2VcIiBcImluc3RhbGxfcHl0aG9uX2RlcGVuZGVuY2llc1wiIHtcbiAgICAgIH4gaWQgICAgICAgPSBcIjQ0ODI1MTU3MzAxODQxNjU4ODJcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICB+IHRyaWdnZXJzID0geyAjIGZvcmNlcyByZXBsYWNlbWVudFxuICAgICAgICAgIH4gXCJtYWluX3ZlcnNpb25cIiAgICAgICAgID0gXCI4YjRjNWQyN2RhODVlY2JhOTU1YWFlM2Q4YjIxNTJkYVwiIC0+IFwiZWNlMzJlZGNkZjcyYTdkMTU2ZTJhOTJlMTI5Mzg2M2RcIlxuICAgICAgICAgICAgIyAoMSB1bmNoYW5nZWQgZWxlbWVudCBoaWRkZW4pXG4gICAgICAgIH1cbiAgICB9XG5cbiAgIyBtb2R1bGUuanVtcGhvc3QucmFuZG9tX3V1aWQubGFtZGFfc3JjX2hhc2ggbXVzdCBiZSByZXBsYWNlZFxuLS8rIHJlc291cmNlIFwicmFuZG9tX3V1aWRcIiBcImxhbWRhX3NyY19oYXNoXCIge1xuICAgICAgfiBpZCAgICAgID0gXCIyY2VkMWJkZi1iNGI1LWY2YzEtMjBkYy00NWFlZDcxZjczOTBcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICB+IGtlZXBlcnMgPSB7ICMgZm9yY2VzIHJlcGxhY2VtZW50XG4gICAgICAgICAgfiBcIm1haW4ucHlcIiAgICAgICAgICA9IFwiOGI0YzVkMjdkYTg1ZWNiYTk1NWFhZTNkOGIyMTUyZGFcIiAtPiBcImVjZTMyZWRjZGY3MmE3ZDE1NmUyYTkyZTEyOTM4NjNkXCJcbiAgICAgICAgICAgICMgKDEgdW5jaGFuZ2VkIGVsZW1lbnQgaGlkZGVuKVxuICAgICAgICB9XG4gICAgICB+IHJlc3VsdCAgPSBcIjJjZWQxYmRmLWI0YjUtZjZjMS0yMGRjLTQ1YWVkNzFmNzM5MFwiIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICB9XG5cblBsYW46IDMgdG8gYWRkLCAxIHRvIGNoYW5nZSwgMyB0byBkZXN0cm95LlxuXG5cdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcblxuU2F2ZWQgdGhlIHBsYW4gdG86IHRmLnBsYW5cblxuVG8gcGVyZm9ybSBleGFjdGx5IHRoZXNlIGFjdGlvbnMsIHJ1biB0aGUgZm9sbG93aW5nIGNvbW1hbmQgdG8gYXBwbHk6XG4gICAgdGVycmFmb3JtIGFwcGx5IFwidGYucGxhblwiXG46OmRlYnVnOjpUZXJyYWZvcm0gZXhpdGVkIHdpdGggY29kZSAwLlxuOjpkZWJ1Zzo6c3Rkb3V0OiBtb2R1bGUuanVtcGhvc3QucmFuZG9tX3V1aWQubGFtZGFfc3JjX2hhc2g6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTJjZWQxYmRmLWI0YjUtZjZjMS0yMGRjLTQ1YWVkNzFmNzM5MF0lMEFtb2R1bGUuanVtcGhvc3QubnVsbF9yZXNvdXJjZS5pbnN0YWxsX3B5dGhvbl9kZXBlbmRlbmNpZXM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTQ0ODI1MTU3MzAxODQxNjU4ODJdJTBBZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbmlzdHJhdG9yLWFjY2VzczogUmVhZGluZy4uLiUwQW1vZHVsZS5qdW1waG9zdC5tb2R1bGUuanVtcGhvc3RfcHJvZmlsZS5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFzc3VtZTogUmVhZGluZy4uLiUwQW1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50Lmp1bXBob3N0X3Blcm1pc3Npb25zOiBSZWFkaW5nLi4uJTBBZGF0YS5hd3NfYXZhaWxhYmlsaXR5X3pvbmVzLnV3MTogUmVhZGluZy4uLiUwQW1vZHVsZS5pbmZyYWhvdXNlX2NvbS5hd3Nfcm91dGU1M196b25lLmluZnJhaG91c2VfY29tOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1aMDc2NjIyNTFMSDNZUkYyRVJNM0ddJTBBbW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX2lhbV9wb2xpY3kuQVdTTGFtYmRhQmFzaWNFeGVjdXRpb25Sb2xlOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi1wZXJtaXNzaW9uczogUmVhZGluZy4uLiUwQW1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19jYWxsZXJfaWRlbnRpdHkuY3VycmVudDogUmVhZGluZy4uLiUwQW1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50Lmp1bXBob3N0X3Blcm1pc3Npb25zOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xMTUyMjY1MTkyXSUwQW1vZHVsZS5naXRodWItY29ubmVjdG9yLmF3c19pYW1fb3BlbmlkX2Nvbm5lY3RfcHJvdmlkZXIuZ2l0aHViOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6NDkzMzcwODI2NDI0Om9pZGMtcHJvdmlkZXIvdG9rZW4uYWN0aW9ucy5naXRodWJ1c2VyY29udGVudC5jb21dJTBBYXdzX2tleV9wYWlyLmFsZWtzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hbGVrc10lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLXBlcm1pc3Npb25zOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0zODk0MDY4ODI2XSUwQW1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFzc3VtZV9yb2xlOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmp1bXBob3N0Lm1vZHVsZS5qdW1waG9zdF9wcm9maWxlLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xOTAzODQ5MzMxXSUwQW1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFzc3VtZV9yb2xlOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0zNjkzNDQ1MDk3XSUwQW1vZHVsZS5qdW1waG9zdC5hd3NfczNfYnVja2V0LmxhbWJkYV90bXA6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtanVtcGhvc3QtbGFtYmRhLTIwMjMwNzEzMjMzNDU5Njc1ODAwMDAwMDAxXSUwQW1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19yZWdpb24uY3VycmVudDogUmVhZGluZy4uLiUwQW1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19hbWkudWJ1bnR1XzIyOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX3JlZ2lvbi5jdXJyZW50OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD11cy13ZXN0LTFdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5LmFkbWluaXN0cmF0b3ItYWNjZXNzOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX2NhbGxlcl9pZGVudGl0eS5jdXJyZW50OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD00OTMzNzA4MjY0MjRdJTBBZGF0YS5hd3NfYW1pLnVidW50dV8yMjogUmVhZGluZy4uLiUwQW1vZHVsZS5tYW5hZ2VtZW50LmF3c192cGMudnBjOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD12cGMtMDhlMTlkODU5YzI2ZDE4YjJdJTBBbW9kdWxlLmp1bXBob3N0Lm1vZHVsZS5qdW1waG9zdF9wcm9maWxlLmF3c19pYW1fcm9sZS5wcm9maWxlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1qdW1waG9zdDIwMjMwNzEwMDQzMDQ0NzYxMDAwMDAwMDAyXSUwQWRhdGEuYXdzX2F2YWlsYWJpbGl0eV96b25lcy51dzE6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMXMgW2lkPXVzLXdlc3QtMV0lMEFtb2R1bGUuanVtcGhvc3QuYXdzX2lhbV9yb2xlLmlhbV9mb3JfbGFtYmRhOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pYW1fZm9yX2xhbWJkYV0lMEFtb2R1bGUuanVtcGhvc3QuZGF0YS5hd3NfYW1pLnVidW50dV8yMjogUmVhZCBjb21wbGV0ZSBhZnRlciAxcyBbaWQ9YW1pLTA3OTM0NTJkZjg4ZDMzYzYzXSUwQW1vZHVsZS5qdW1waG9zdC5tb2R1bGUuanVtcGhvc3RfcHJvZmlsZS5hd3NfaWFtX3BvbGljeS5wcm9maWxlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6NDkzMzcwODI2NDI0OnBvbGljeS9qdW1waG9zdDIwMjMwNzEwMDQzMDQ0NzYwNDAwMDAwMDAxXSUwQWRhdGEuYXdzX2FtaS51YnVudHVfMjI6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMXMgW2lkPWFtaS0wNzkzNDUyZGY4OGQzM2M2M10lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLWFzc3VtZTogUmVhZGluZy4uLiUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0zOTExODQ0ODY4XSUwQW1vZHVsZS5tYW5hZ2VtZW50LmF3c19laXAubmF0X2VpcFtcIjEwLjAuMC4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1laXBhbGxvYy0wMmI0MmU3MGQ1MmE1ZGI3Zl0lMEFtb2R1bGUubWFuYWdlbWVudC5hd3NfZWlwLm5hdF9laXBbXCIxMC4wLjIuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ZWlwYWxsb2MtMDE2MDM1MjQ2YjQ5MTAyYjVdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5hd3NfaWFtX3JvbGUuZ2l0aHViOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtZ2l0aHViXSUwQW1vZHVsZS5qdW1waG9zdC5tb2R1bGUuanVtcGhvc3RfcHJvZmlsZS5hd3NfaWFtX2luc3RhbmNlX3Byb2ZpbGUucHJvZmlsZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9anVtcGhvc3RdJTBBbW9kdWxlLmp1bXBob3N0Lm1vZHVsZS5qdW1waG9zdF9wcm9maWxlLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5qdW1waG9zdDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9anVtcGhvc3QyMDIzMDcxMDA0MzA0NDc2MTAwMDAwMDAwMi0yMDIzMDcxMDA0MzA0NTc4MTEwMDAwMDAwM10lMEFtb2R1bGUuaW5mcmFob3VzZV9jb20uYXdzX3JvdXRlNTNfcmVjb3JkLnR4dF9ka2ltOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1aMDc2NjIyNTFMSDNZUkYyRVJNM0dfZ29vZ2xlLl9kb21haW5rZXkuaW5mcmFob3VzZS5jb21fVFhUXSUwQW1vZHVsZS5pbmZyYWhvdXNlX2NvbS5hd3Nfcm91dGU1M19yZWNvcmQubXg6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPVowNzY2MjI1MUxIM1lSRjJFUk0zR19pbmZyYWhvdXNlLmNvbV9NWF0lMEFtb2R1bGUuaW5mcmFob3VzZV9jb20uYXdzX3JvdXRlNTNfcmVjb3JkLnNwZjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9WjA3NjYyMjUxTEgzWVJGMkVSTTNHX2luZnJhaG91c2UuY29tX1NQRl0lMEFtb2R1bGUuaW5mcmFob3VzZV9jb20uYXdzX3JvdXRlNTNfcmVjb3JkLnR4dF9zcGY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPVowNzY2MjI1MUxIM1lSRjJFUk0zR19pbmZyYWhvdXNlLmNvbV9UWFRdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFkbWluLWFzc3VtZTogUmVhZGluZy4uLiUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hZG1pbi1hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTEzODI5MzcxNjldJTBBbW9kdWxlLmp1bXBob3N0LmF3c19sYXVuY2hfdGVtcGxhdGUuanVtcGhvc3Q6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWx0LTAxYThlZjk2ODIyYjRiMDBiXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW4uYXdzX2lhbV9yb2xlLmFkbWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW5dJTBBbW9kdWxlLmp1bXBob3N0LmF3c19zM19vYmplY3QubGFtYmRhX3BhY2thZ2U6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTJjZWQxYmRmLWI0YjUtZjZjMS0yMGRjLTQ1YWVkNzFmNzM5MC56aXBdJTBBbW9kdWxlLmp1bXBob3N0LmF3c19zM19idWNrZXRfcHVibGljX2FjY2Vzc19ibG9jay5wdWJsaWNfYWNjZXNzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWp1bXBob3N0LWxhbWJkYS0yMDIzMDcxMzIzMzQ1OTY3NTgwMDAwMDAwMV0lMEFtb2R1bGUuanVtcGhvc3QuYXdzX2xhbWJkYV9mdW5jdGlvbi51cGRhdGVfZG5zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD11cGRhdGVfZG5zXSUwQW1vZHVsZS5tYW5hZ2VtZW50LmF3c19yb3V0ZV90YWJsZS5hbGxbXCIxMC4wLjMuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cnRiLTAxNzhlMTcxOGRlYmE1MWNlXSUwQW1vZHVsZS5tYW5hZ2VtZW50LmF3c19kZWZhdWx0X3NlY3VyaXR5X2dyb3VwLmRlZmF1bHQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXNnLTA4Yjk2MGI4NWY1OTk2MTAwXSUwQW1vZHVsZS5tYW5hZ2VtZW50LmF3c19zdWJuZXQuYWxsW1wiMTAuMC4yLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXN1Ym5ldC0wODNlOTY5ZGMzNzc5YWYyNl0lMEFtb2R1bGUubWFuYWdlbWVudC5hd3Nfc3VibmV0LmFsbFtcIjEwLjAuMy4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zdWJuZXQtMGNmZmZhY2EzMjVkOTM4MjddJTBBbW9kdWxlLm1hbmFnZW1lbnQuYXdzX3N1Ym5ldC5hbGxbXCIxMC4wLjAuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c3VibmV0LTBkZjg4NWRjYzk5NDE4Nzk5XSUwQW1vZHVsZS5tYW5hZ2VtZW50LmF3c19zdWJuZXQuYWxsW1wiMTAuMC4xLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXN1Ym5ldC0wZjkxZGQyNjc1ZTdhMTZjM10lMEFtb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGVfdGFibGUuYWxsW1wiMTAuMC4wLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXJ0Yi0wNGExNmU3NGQ1YjEyYTMzOF0lMEFtb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGVfdGFibGUuYWxsW1wiMTAuMC4xLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXJ0Yi0wNjdjMzBlNjVkZDQxMDhlOV0lMEFtb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGVfdGFibGUuYWxsW1wiMTAuMC4yLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXJ0Yi0wYmM2YzQ0YzFiMjZmZWQyMl0lMEFtb2R1bGUubWFuYWdlbWVudC5hd3NfZGVmYXVsdF9yb3V0ZV90YWJsZS5kZWZhdWx0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGItMGQ3MzM4M2FmZWI2YWQxNDJdJTBBbW9kdWxlLm1hbmFnZW1lbnQuYXdzX2ludGVybmV0X2dhdGV3YXkuaWc6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWlndy0wNzkwOTBlMDllZDVkYjU4Ml0lMEFtb2R1bGUubWFuYWdlbWVudC5hd3NfbmF0X2dhdGV3YXkubmF0X2d3W1wiMTAuMC4wLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPW5hdC0wOGZiOWI1MjY4MzI3Nzk0N10lMEFtb2R1bGUubWFuYWdlbWVudC5hd3NfbmF0X2dhdGV3YXkubmF0X2d3W1wiMTAuMC4yLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPW5hdC0wOGIxY2QwNmIwNDMwOTllY10lMEFtb2R1bGUuanVtcGhvc3QuYXdzX2F1dG9zY2FsaW5nX2dyb3VwLmp1bXBob3N0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1qdW1waG9zdC0yMDIzMDcxMDA0NTUxMjE2NTQwMDAwMDAwMV0lMEFtb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGVfdGFibGVfYXNzb2NpYXRpb24ucHJpdmF0ZV9ydF9hc3NvY1tcIjEwLjAuMS4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGJhc3NvYy0wOTliOTU4YWYxOTQ4NWYyYl0lMEFtb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGVfdGFibGVfYXNzb2NpYXRpb24ucHJpdmF0ZV9ydF9hc3NvY1tcIjEwLjAuMi4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGJhc3NvYy0wZTc5NWJkYWVlNjI3YWE2Y10lMEFtb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGVfdGFibGVfYXNzb2NpYXRpb24ucHJpdmF0ZV9ydF9hc3NvY1tcIjEwLjAuMy4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGJhc3NvYy0wYmYyNzhiNmEzOTRhZWQ0NF0lMEFtb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGVfdGFibGVfYXNzb2NpYXRpb24ucHJpdmF0ZV9ydF9hc3NvY1tcIjEwLjAuMC4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGJhc3NvYy0wOGE0MTAxNjBlMmRjYzU5Ml0lMEFtb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGUuc3VibmV0X3B1YmxpY1tcIjEwLjAuMi4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1yLXJ0Yi0wYmM2YzQ0YzFiMjZmZWQyMjEwODAyODk0OTRdJTBBbW9kdWxlLm1hbmFnZW1lbnQuYXdzX3JvdXRlLnN1Ym5ldF9wdWJsaWNbXCIxMC4wLjAuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ci1ydGItMDRhMTZlNzRkNWIxMmEzMzgxMDgwMjg5NDk0XSUwQW1vZHVsZS5tYW5hZ2VtZW50LmF3c19yb3V0ZS5kZWZhdWx0X21haW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXItcnRiLTBkNzMzODNhZmViNmFkMTQyMTA4MDI4OTQ5NF0lMEFtb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGUuc3VibmV0X3ByaXZhdGVbXCIxMC4wLjEuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ci1ydGItMDY3YzMwZTY1ZGQ0MTA4ZTkxMDgwMjg5NDk0XSUwQW1vZHVsZS5tYW5hZ2VtZW50LmF3c19yb3V0ZS5zdWJuZXRfcHJpdmF0ZVtcIjEwLjAuMy4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1yLXJ0Yi0wMTc4ZTE3MThkZWJhNTFjZTEwODAyODk0OTRdJTBBbW9kdWxlLmp1bXBob3N0LmF3c19jbG91ZHdhdGNoX2xvZ19ncm91cC51cGRhdGVfZG5zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD0vYXdzL2xhbWJkYS91cGRhdGVfZG5zXSUwQW1vZHVsZS5qdW1waG9zdC5hd3NfYXV0b3NjYWxpbmdfbGlmZWN5Y2xlX2hvb2subGF1bmNoaW5nOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1sYXVuY2hpbmddJTBBbW9kdWxlLmp1bXBob3N0LmF3c19jbG91ZHdhdGNoX2V2ZW50X3J1bGUuc2NhbGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWp1bXBob3N0LXNjYWxlMjAyMzA3MTExNzI3NDc1MDQ3MDAwMDAwMDFdJTBBbW9kdWxlLmp1bXBob3N0LmF3c19hdXRvc2NhbGluZ19saWZlY3ljbGVfaG9vay50ZXJtaW5hdGluZzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVybWluYXRpbmddJTBBbW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQubGFtYmRhLXBlcm1pc3Npb25zOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQubGFtYmRhLXBlcm1pc3Npb25zOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0zNTkwNDEzNzE5XSUwQW1vZHVsZS5qdW1waG9zdC5hd3NfaWFtX3BvbGljeS5sYW1iZGFfcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjo0OTMzNzA4MjY0MjQ6cG9saWN5L2xhbWJkYV9wZXJtaXNzaW9uczIwMjMwNzExMTYwNTEyNzI0MjAwMDAwMDAxXSUwQW1vZHVsZS5qdW1waG9zdC5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQubGFtYmRhX3Blcm1pc3Npb25zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pYW1fZm9yX2xhbWJkYS0yMDIzMDcxMTE2MDUxMzQxNjEwMDAwMDAwMl0lMEFtb2R1bGUuanVtcGhvc3QuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5sYW1iZGFfbG9nZ2luZzogUmVhZGluZy4uLiUwQW1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmxhbWJkYV9sb2dnaW5nOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yMjY3MTQ1MzgyXSUwQW1vZHVsZS5qdW1waG9zdC5hd3NfaWFtX3BvbGljeS5sYW1iZGFfbG9nZ2luZzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjQ5MzM3MDgyNjQyNDpwb2xpY3kvbGFtYmRhX2xvZ2dpbmcyMDIzMDcxMTE2MDUxMzc3ODMwMDAwMDAwM10lMEFtb2R1bGUuanVtcGhvc3QuYXdzX2xhbWJkYV9wZXJtaXNzaW9uLmFsbG93X2Nsb3Vkd2F0Y2g6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPUFsbG93RXhlY3V0aW9uRnJvbUNsb3VkV2F0Y2gtb3V0XSUwQW1vZHVsZS5qdW1waG9zdC5hd3NfY2xvdWR3YXRjaF9ldmVudF90YXJnZXQuc2NhbGUtb3V0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1qdW1waG9zdC1zY2FsZTIwMjMwNzExMTcyNzQ3NTA0NzAwMDAwMDAxLXRlcnJhZm9ybS0yMDIzMDcxMTE3Mjc0NzYzMDkwMDAwMDAwMl0lMEFtb2R1bGUuanVtcGhvc3QuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmxhbWJkYV9sb2dzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pYW1fZm9yX2xhbWJkYS0yMDIzMDcxMTE2MDUxNDI1MTEwMDAwMDAwNF0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW5pc3RyYXRvci1hY2Nlc3M6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMnMgW2lkPWFybjphd3M6aWFtOjphd3M6cG9saWN5L0FkbWluaXN0cmF0b3JBY2Nlc3NdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuYWRtaW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi0yMDIzMDcwOTE2NDMyMTMxOTkwMDAwMDAwMV0lMEFkYXRhLmF3c19pYW1fcG9saWN5LmFkbWluaXN0cmF0b3ItYWNjZXNzOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDJzIFtpZD1hcm46YXdzOmlhbTo6YXdzOnBvbGljeS9BZG1pbmlzdHJhdG9yQWNjZXNzXSUwQW1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19pYW1fcG9saWN5LkFXU0xhbWJkYUJhc2ljRXhlY3V0aW9uUm9sZTogUmVhZCBjb21wbGV0ZSBhZnRlciAzcyBbaWQ9YXJuOmF3czppYW06OmF3czpwb2xpY3kvc2VydmljZS1yb2xlL0FXU0xhbWJkYUJhc2ljRXhlY3V0aW9uUm9sZV0lMEFtb2R1bGUuanVtcGhvc3QuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LkFXU0xhbWJkYUJhc2ljRXhlY3V0aW9uUm9sZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWFtX2Zvcl9sYW1iZGEtMjAyMzA3MTAxNzU0MzQ4NzgwMDAwMDAwMDFdJTBBJTBBVGVycmFmb3JtIHVzZWQgdGhlIHNlbGVjdGVkIHByb3ZpZGVycyB0byBnZW5lcmF0ZSB0aGUgZm9sbG93aW5nIGV4ZWN1dGlvbiUwQXBsYW4uIFJlc291cmNlIGFjdGlvbnMgYXJlIGluZGljYXRlZCB3aXRoIHRoZSBmb2xsb3dpbmcgc3ltYm9sczolMEEgIH4gdXBkYXRlIGluLXBsYWNlJTBBLS8rIGRlc3Ryb3kgYW5kIHRoZW4gY3JlYXRlIHJlcGxhY2VtZW50JTBBIDw9IHJlYWQgKGRhdGEgcmVzb3VyY2VzKSUwQSUwQVRlcnJhZm9ybSB3aWxsIHBlcmZvcm0gdGhlIGZvbGxvd2luZyBhY3Rpb25zOiUwQSUwQSAgIyBtb2R1bGUuanVtcGhvc3QuZGF0YS5hcmNoaXZlX2ZpbGUubGFtYmRhIHdpbGwgYmUgcmVhZCBkdXJpbmcgYXBwbHklMEEgICMgKGNvbmZpZyByZWZlcnMgdG8gdmFsdWVzIG5vdCB5ZXQga25vd24pJTBBIDw9IGRhdGEgXCJhcmNoaXZlX2ZpbGVcIiBcImxhbWJkYVwiIHslMEEgICAgICArIGV4Y2x1ZGVzICAgICAgICAgICAgPSBbJTBBICAgICAgICAgICsgXCJfX3B5Y2FjaGVfX1wiLCUwQSAgICAgICAgXSUwQSAgICAgICsgaWQgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG91dHB1dF9iYXNlNjRzaGEyNTYgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBvdXRwdXRfYmFzZTY0c2hhNTEyID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgb3V0cHV0X21kNSAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG91dHB1dF9wYXRoICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBvdXRwdXRfc2hhICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgb3V0cHV0X3NoYTI1NiAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG91dHB1dF9zaGE1MTIgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBvdXRwdXRfc2l6ZSAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgc291cmNlX2RpciAgICAgICAgICA9IFwibW9kdWxlcy9qdW1waG9zdC91cGRhdGVfZG5zXCIlMEEgICAgICArIHR5cGUgICAgICAgICAgICAgICAgPSBcInppcFwiJTBBICAgIH0lMEElMEEgICMgbW9kdWxlLmp1bXBob3N0LmF3c19sYW1iZGFfZnVuY3Rpb24udXBkYXRlX2RucyB3aWxsIGJlIHVwZGF0ZWQgaW4tcGxhY2UlMEEgIH4gcmVzb3VyY2UgXCJhd3NfbGFtYmRhX2Z1bmN0aW9uXCIgXCJ1cGRhdGVfZG5zXCIgeyUwQSAgICAgICAgaWQgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJ1cGRhdGVfZG5zXCIlMEEgICAgICB+IGxhc3RfbW9kaWZpZWQgICAgICAgICAgICAgICAgICA9IFwiMjAyMy0wNy0xNlQwMzowNzoxMS4wMDArMDAwMFwiIC0+IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICB+IHMzX2tleSAgICAgICAgICAgICAgICAgICAgICAgICA9IFwiMmNlZDFiZGYtYjRiNS1mNmMxLTIwZGMtNDVhZWQ3MWY3MzkwLnppcFwiIC0+IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICAgIHRhZ3MgICAgICAgICAgICAgICAgICAgICAgICAgICA9IHt9JTBBICAgICAgICAjICgyMSB1bmNoYW5nZWQgYXR0cmlidXRlcyBoaWRkZW4pJTBBJTBBICAgICAgICAjICgzIHVuY2hhbmdlZCBibG9ja3MgaGlkZGVuKSUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5qdW1waG9zdC5hd3NfczNfb2JqZWN0LmxhbWJkYV9wYWNrYWdlIG11c3QgYmUgcmVwbGFjZWQlMEEtLysgcmVzb3VyY2UgXCJhd3NfczNfb2JqZWN0XCIgXCJsYW1iZGFfcGFja2FnZVwiIHslMEEgICAgICB+IGJ1Y2tldF9rZXlfZW5hYmxlZCAgICAgPSBmYWxzZSAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgfiBjb250ZW50X3R5cGUgICAgICAgICAgID0gXCJiaW5hcnkvb2N0ZXQtc3RyZWFtXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIH4gZXRhZyAgICAgICAgICAgICAgICAgICA9IFwiMjNhYWFhMjlmNTE3ZTRhNDAxYjVhZGUyNGVhNDJiYjItM1wiIC0+IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICB+IGlkICAgICAgICAgICAgICAgICAgICAgPSBcIjJjZWQxYmRmLWI0YjUtZjZjMS0yMGRjLTQ1YWVkNzFmNzM5MC56aXBcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgfiBrZXkgICAgICAgICAgICAgICAgICAgID0gXCIyY2VkMWJkZi1iNGI1LWY2YzEtMjBkYy00NWFlZDcxZjczOTAuemlwXCIgIyBmb3JjZXMgcmVwbGFjZW1lbnQgLT4gKGtub3duIGFmdGVyIGFwcGx5KSAjIGZvcmNlcyByZXBsYWNlbWVudCUwQSAgICAgICsga21zX2tleV9pZCAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICAtIG1ldGFkYXRhICAgICAgICAgICAgICAgPSB7fSAtPiBudWxsJTBBICAgICAgfiBzZXJ2ZXJfc2lkZV9lbmNyeXB0aW9uID0gXCJBRVMyNTZcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgfiBzb3VyY2UgICAgICAgICAgICAgICAgID0gXCJtb2R1bGVzL2p1bXBob3N0LzJjZWQxYmRmLWI0YjUtZjZjMS0yMGRjLTQ1YWVkNzFmNzM5MC56aXBcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgfiBzdG9yYWdlX2NsYXNzICAgICAgICAgID0gXCJTVEFOREFSRFwiIC0+IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICAtIHRhZ3MgICAgICAgICAgICAgICAgICAgPSB7fSAtPiBudWxsJTBBICAgICAgKyB2ZXJzaW9uX2lkICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICAgIyAoNCB1bmNoYW5nZWQgYXR0cmlidXRlcyBoaWRkZW4pJTBBICAgIH0lMEElMEEgICMgbW9kdWxlLmp1bXBob3N0Lm51bGxfcmVzb3VyY2UuaW5zdGFsbF9weXRob25fZGVwZW5kZW5jaWVzIG11c3QgYmUgcmVwbGFjZWQlMEEtLysgcmVzb3VyY2UgXCJudWxsX3Jlc291cmNlXCIgXCJpbnN0YWxsX3B5dGhvbl9kZXBlbmRlbmNpZXNcIiB7JTBBICAgICAgfiBpZCAgICAgICA9IFwiNDQ4MjUxNTczMDE4NDE2NTg4MlwiIC0+IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICB+IHRyaWdnZXJzID0geyAjIGZvcmNlcyByZXBsYWNlbWVudCUwQSAgICAgICAgICB+IFwibWFpbl92ZXJzaW9uXCIgICAgICAgICA9IFwiOGI0YzVkMjdkYTg1ZWNiYTk1NWFhZTNkOGIyMTUyZGFcIiAtPiBcImVjZTMyZWRjZGY3MmE3ZDE1NmUyYTkyZTEyOTM4NjNkXCIlMEEgICAgICAgICAgICAjICgxIHVuY2hhbmdlZCBlbGVtZW50IGhpZGRlbiklMEEgICAgICAgIH0lMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUuanVtcGhvc3QucmFuZG9tX3V1aWQubGFtZGFfc3JjX2hhc2ggbXVzdCBiZSByZXBsYWNlZCUwQS0vKyByZXNvdXJjZSBcInJhbmRvbV91dWlkXCIgXCJsYW1kYV9zcmNfaGFzaFwiIHslMEEgICAgICB+IGlkICAgICAgPSBcIjJjZWQxYmRmLWI0YjUtZjZjMS0yMGRjLTQ1YWVkNzFmNzM5MFwiIC0+IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICB+IGtlZXBlcnMgPSB7ICMgZm9yY2VzIHJlcGxhY2VtZW50JTBBICAgICAgICAgIH4gXCJtYWluLnB5XCIgICAgICAgICAgPSBcIjhiNGM1ZDI3ZGE4NWVjYmE5NTVhYWUzZDhiMjE1MmRhXCIgLT4gXCJlY2UzMmVkY2RmNzJhN2QxNTZlMmE5MmUxMjkzODYzZFwiJTBBICAgICAgICAgICAgIyAoMSB1bmNoYW5nZWQgZWxlbWVudCBoaWRkZW4pJTBBICAgICAgICB9JTBBICAgICAgfiByZXN1bHQgID0gXCIyY2VkMWJkZi1iNGI1LWY2YzEtMjBkYy00NWFlZDcxZjczOTBcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgIH0lMEElMEFQbGFuOiAzIHRvIGFkZCwgMSB0byBjaGFuZ2UsIDMgdG8gZGVzdHJveS4lMEElMEFcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDAlMEElMEFTYXZlZCB0aGUgcGxhbiB0bzogdGYucGxhbiUwQSUwQVRvIHBlcmZvcm0gZXhhY3RseSB0aGVzZSBhY3Rpb25zLCBydW4gdGhlIGZvbGxvd2luZyBjb21tYW5kIHRvIGFwcGx5OiUwQSAgICB0ZXJyYWZvcm0gYXBwbHkgXCJ0Zi5wbGFuXCIlMEFcbjo6ZGVidWc6OnN0ZGVycjogXG46OmRlYnVnOjpleGl0Y29kZTogMFxuIiwgInN0ZGVyciI6ICIiLCAiYWRkIjogMywgImNoYW5nZSI6IDEsICJkZXN0cm95IjogM319```
</p></details>